Конфигурация/InformationRegisters/КупонныйДоходПоОблигациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КупонныйДоходПоОблигациям</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтавкаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияКупона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупонаВВалютеОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыплатыПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыплатыФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКупона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчетаСтавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаОпределена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Облигация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ФормулыРасчетаСтавокКупонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ФормулыРасчетаСтавокКупонов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФормулаРасчетаСтавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Облигация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерКупона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/КупонныйДоходПоОблигациям/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма, "Запись", "ИсходныйКлючЗаписи", Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ФормулаРасчетаСтавкиНажатие(Элемент, СтандартнаяОбработка)
	
	Если Не РаботаСПользователями.ЭтоПолноправныйПользователь() Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	// Выбор действия
	
	Если ЗначениеЗаполнено(Запись.ФормулаРасчетаСтавки) Тогда
	
		Меню = Новый СписокЗначений;
		Меню.Добавить("Открыть");
		Меню.Добавить("Изменить");
		
		ВыбранныйПункт = ВыбратьИзМеню(Меню, Элемент);
		
		Действие = ?(ВыбранныйПункт = Неопределено, Неопределено, ВыбранныйПункт.Значение);
		
	Иначе
		
		Действие = "Изменить";
		
	КонецЕсли;
	
	// Открытие формулы
	
	Если Действие = "Открыть" Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", Запись.ФормулаРасчетаСтавки);
		
		ОткрытьФормуМодально("Справочник.НастройкиРасчета.ФормаОбъекта", ПараметрыФормы, Элемент);
	
		ОбновитьПредставлениеФормулыРасчетаСтавки(ЭтаФорма);
		
	ИначеЕсли Действие = "Изменить" Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор",		 Новый Структура("Облигация, НомерКупона", Запись.Облигация, Запись.НомерКупона));
		ПараметрыФормы.Вставить("ТекущаяСтрока", ПолучитьКлючЗаписиФормулыРасчетаСтавки(Запись.Облигация, Запись.НомерКупона));
		
		ОписаниеОповещенияОЗакрытииОкнаФормул = Новый ОписаниеОповещения("ПриЗакрытииОкнаФормулРасчетаСтавкиКупона", ЭтаФорма);
		
		ОткрытьФорму("РегистрСведений.ФормулыРасчетаСтавокКупонов.ФормаСписка", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещенияОЗакрытииОкнаФормул, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОбновитьНажатие(Элемент)
	
	СтандартнаяОбработка = Ложь;
	
	Если Вопрос("Обновить текущий элемент?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ОбновитьДанные();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	ОбновитьПредставлениеФормулыРасчетаСтавки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(НеСообщатьОбИзмененииОбъектов = Неопределено, НеСообщатьОбОтсутствииИзменений = Неопределено)

	РаботаСВнешнимиСистемами.ОбновитьРеквизитыОбъектаИзМатрикс(Запись.Облигация, , , НеСообщатьОбИзмененииОбъектов, НеСообщатьОбОтсутствииИзменений);
		
	ЭтаФорма.Прочитать();
	
КонецПроцедуры

#Область Настройка_формулы_расчета_ставки_купона

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПредставлениеФормулыРасчетаСтавки(Форма)
	
	Форма.ФормулаРасчетаСтавки = ?(ЗначениеЗаполнено(Форма.Запись.ФормулаРасчетаСтавки), Форма.Запись.ФормулаРасчетаСтавки, "Не задана");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКлючЗаписиФормулыРасчетаСтавки(Облигация, НомерКупона)
	
	ЗначенияКлюча = Новый Структура("Облигация, НомерКупона", Облигация, НомерКупона);
	
	ПоследниеЗаписи = РегистрыСведений.ФормулыРасчетаСтавокКупонов.СрезПоследних(ТекущаяДата(), ЗначенияКлюча);
	Если ПоследниеЗаписи.Количество() > 0 Тогда
		ЗначенияКлюча.Вставить("Период", ПоследниеЗаписи[0].Период);
	КонецЕсли;
	
	КлючЗаписи = РегистрыСведений.ФормулыРасчетаСтавокКупонов.СоздатьКлючЗаписи(ЗначенияКлюча); 
	
	Возврат КлючЗаписи;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьФормулуРасчетаСтавки(Облигация, НомерКупона)
	
	ДействующаяЗапись = РегистрыСведений.ФормулыРасчетаСтавокКупонов.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("Облигация, НомерКупона", Облигация, НомерКупона));

	ФормулаРасчета = ?(ДействующаяЗапись.Действует, ДействующаяЗапись.ФормулаРасчетаСтавки, Справочники.НастройкиРасчета.ПустаяСсылка()); 	
	
	Возврат ФормулаРасчета;
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииОкнаФормулРасчетаСтавкиКупона(Результат, Параметры) Экспорт
	
	ДействущееЗначение = ПолучитьФормулуРасчетаСтавки(Запись.Облигация, Запись.НомерКупона); 
	
	Если Запись.ФормулаРасчетаСтавки <> ДействущееЗначение Тогда
		
		Ответ = Вопрос("Формула расчета ставки изменилась. Обновить данные?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ОбновитьДанные(Истина, Истина);	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
